Autodesk.Revit.DB.Mechanical.DuctInsulation.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Double)
Creates a new instance of duct insulation.
document:
The document.
ductOrContentElementId:
The duct , fitting or accessory ElementId to which insulation will be added.
ductInsulationTypeId:
The duct insulation type.
If the input duct insulation type is InvalidElementId, the default insulation type from the document will be used.
Thickness:
The thickness of the insulation.
Returns:
The newly created duct insulation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This id does not represent a duct, fitting, or accessory element.
-or-
This duct insulation type is invalid.
-or-
Thickness is not valid for assignment to insulation or lining elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012